<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Guided Practice: Inspecting Data Types and Applying Functions

_Authors: Dave Yerrington (SF)_

---

In [9]:
import pandas as pd
import numpy as np

**1. Create a small DataFrame with different data types (provided).**

In [10]:
# create a small dictionary with different data types

dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                                F = False,
                                G = pd.Series([1]*3,dtype='int8')))

dft

          A  B    C          D    E      F  G
0  0.204660  1  foo 2001-01-02  1.0  False  1
1  0.620784  1  foo 2001-01-02  1.0  False  1
2  0.954576  1  foo 2001-01-02  1.0  False  1

**2. Examine the data types of the columns.**

In [11]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

**3. Create a Series object with the integers 1-5 and float 6.0. What data type is the Series?**

In [12]:
se = pd.Series([1,2,3,4,5,6.])
se.dtypes

dtype('float64')

**4. Create a Series with data: `[1, 2, 3, 6., 'foo']`. What data type is the series?**

In [22]:
s = pd.Series([1,2,3,6.,'foo'])
s.dtype

dtype('O')

**5. Find how many columns of each type there are with the `.get_dtype_counts()` function.**

In [23]:
dft.get_dtype_counts()

bool              1
datetime64[ns]    1
float32           1
float64           1
int64             1
int8              1
object            1
dtype: int64

**6. Create another small DataFrame (provided).**

In [24]:
# create a small data frame. 
df = pd.DataFrame(np.random.randn(5, 4), columns=['a', 'b', 'c', 'd'])

**7. Use the `.apply()` function to find the square root of all the cells.**

In [26]:
df.apply(np.sqrt)

          a         b         c         d
0  0.545585       NaN  0.357007  0.958161
1  0.434984  0.357143       NaN       NaN
2  0.973621       NaN  1.392722  1.172973
3       NaN  0.926062  1.389678  0.719729
4       NaN       NaN  0.913231       NaN

**8. Use `.apply()` to find the mean of the columns.**

In [28]:
df.apply(np.mean, axis = 0)

a    0.100513
b   -0.291844
c    0.824847
d    0.189073
dtype: float64

**9. Find the mean of the rows.**

In [29]:
df.apply(np.mean, axis=1)

0    0.139514
1   -0.097994
2    0.969371
3    0.747842
4   -0.730495
dtype: float64

**10. Use numpy to create a random vector of 50 numbers ranging from 0 to 6.**

*Hint: This can be done with `np.random.randint()`.

In [35]:
dude = np.random.randint(0,7,50)

**11. Convert the vector to a Series and count the occurrences of each number.**

In [36]:
pd.Series(dude).value_counts()

1    15
4     8
6     7
2     6
3     5
0     5
5     4
dtype: int64

---

# Independent practice: sales data

---
**1. Load the `sales.csv` data set from the datasets directory.**

In [93]:
sales = pd.read_csv('datasets/sales.csv')

**2. Inspect the data types.**

In [94]:
sales.dtypes
sales.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    18.420760    93.802281      337166.53      337804.05
1     4.776510    21.082425       22351.86       21736.63
2    16.602401    93.612494      277764.46      306942.27
3     4.296111    16.824704       16805.11        9307.75
4     8.156023    35.011457       54411.42       58939.90

**3. Imagine you've found out that all your values in the first column are off by 1. Use `.apply()` or `.map()` to add 1 to the first column of the dataset.**

In [101]:
sales['volume_sold']=sales['volume_sold'].map(lambda x:x+1)
sales.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    19.420760    93.802281      337166.53      337804.05
1     5.776510    21.082425       22351.86       21736.63
2    17.602401    93.612494      277764.46      306942.27
3     5.296111    16.824704       16805.11        9307.75
4     9.156023    35.011457       54411.42       58939.90

**4. Use `.value_counts` to count the values of the first column of the dataset.**

In [102]:
sales['volume_sold'].value_counts()

17.059971    1
12.232324    1
7.290971     1
14.635150    1
6.047530     1
6.906274     1
7.618174     1
10.292241    1
5.200122     1
4.210727     1
12.997117    1
8.200364     1
46.556096    1
6.778097     1
5.385455     1
11.804337    1
9.017945     1
16.697651    1
7.654407     1
9.300180     1
7.537069     1
7.433606     1
5.776510     1
11.186622    1
9.156023     1
6.531061     1
6.294400     1
12.697456    1
15.439435    1
8.390988     1
            ..
8.682494     1
10.127095    1
11.292681    1
6.324497     1
5.296111     1
10.348477    1
13.581695    1
13.395919    1
52.800686    1
12.625606    1
11.677295    1
11.252870    1
5.941294     1
15.606750    1
30.878030    1
11.331430    1
8.434821     1
8.196779     1
8.785867     1
12.091709    1
13.509967    1
6.147729     1
13.350027    1
6.388070     1
9.555078     1
12.840780    1
6.723896     1
8.437252     1
5.456466     1
11.705327    1
Name: volume_sold, Length: 200, dtype: int64

**BONUS: The `.value_counts()` output in question four isn't very insightful.  Use [Pandas.DataFrame.round](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.round.html) to round the column to the nearest tenth before runing `.value_counts()`.**

In [103]:
sales['volume_sold'].apply(np.round).value_counts()

9.0     28
8.0     24
10.0    24
7.0     22
6.0     20
11.0    17
12.0    15
13.0    14
5.0     12
14.0     4
4.0      3
15.0     3
53.0     2
17.0     2
18.0     1
16.0     1
51.0     1
47.0     1
20.0     1
31.0     1
49.0     1
57.0     1
77.0     1
19.0     1
Name: volume_sold, dtype: int64